GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p16F17114.inc
;----- CONFIG4 Options --------------------------------------------------
_BBSIZE_BB512        EQU  H'3FFF'; 512 words boot block size
_BBSIZE_BB1K         EQU  H'3FFE'; 1024 words boot block size
_BBSIZE_BB2K         EQU  H'3FFD'; 2048 words boot block size
_BBSIZE_BB4K         EQU  H'3FFC'; 4096 word boot block size
_BBSIZE_BB8K         EQU  H'3FFB'; 8192 word boot block size
_BBSIZE_BB16K        EQU  H'3FFA'; 16384 word boot block size
_BBSIZE_BB32K        EQU  H'3FF9'; * half of user program memory
_BBSIZE_BB64K        EQU  H'3FF8'; * half of user program memory
_BBEN_OFF            EQU  H'3FFF'; Boot Block disabled
_BBEN_ON             EQU  H'3FF7'; Boot Block enabled
_SAFEN_OFF           EQU  H'3FFF'; SAF disabled
_SAFEN_ON            EQU  H'3FEF'; SAF enabled
_WRTAPP_OFF          EQU  H'3FFF'; Application Block is NOT write protected
_WRTAPP_ON           EQU  H'3F7F'; Application Block is write protected
_WRTB_OFF            EQU  H'3FFF'; Boot Block is NOT write protected
_WRTB_ON             EQU  H'3EFF'; Boot Block is write protected
_WRTC_OFF            EQU  H'3FFF'; Configuration Register is NOT write protected
_WRTC_ON             EQU  H'3DFF'; Configuration Register is write protected
_WRTD_OFF            EQU  H'3FFF'; Data EEPROM is NOT write protected
_WRTD_ON             EQU  H'3BFF'; Data EEPROM is write protected
_WRTSAF_OFF          EQU  H'3FFF'; SAF is NOT write protected
_WRTSAF_ON           EQU  H'37FF'; SAF is write protected
_LVP_ON              EQU  H'3FFF'; Low Voltage programming enabled. MCLR/Vpp pin function is MCLR. MCLRE Configuration bit is ignored
_LVP_OFF             EQU  H'1FFF'; High Voltage on MCLR/Vpp must be used for programming

;----- CONFIG5 Options --------------------------------------------------
_CP_OFF              EQU  H'3FFF'; Program Flash Memory code protection is disabled
_CP_ON               EQU  H'3FFE'; Program Flash Memory code protection is enabled
_CPD_OFF             EQU  H'3FFF'; Data EEPROM code protection is disabled
_CPD_ON              EQU  H'3FFD'; Data EEPROM code protection is enabled

;----- DEVID Equates --------------------------------------------------
_IDLOC0            EQU  H'8000'
_IDLOC1            EQU  H'8001'
_IDLOC2            EQU  H'8001'
_IDLOC3            EQU  H'8002'
_IDLOC4            EQU  H'8002'
_IDLOC5            EQU  H'8003'
_IDLOC6            EQU  H'8003'
_IDLOC7            EQU  H'8004'

        LIST
